import { Header } from "@/components/Header";
import { LinkPreview } from "@/components/ui/link-preview";

import dynamic from "next/dynamic";

// نوع بازگشتی مشخص شده است
const DynamicMapBox = dynamic<any>(
  () => import("@/components/Maps/FirstMap").then((mod) => mod.FirstMap as any),
  {
    ssr: false, // disable server-side rendering
  }
);

export default function Home() {
  return (
    <main className="w-full flex flex-col items-end min-h-screen">
      <Header />
      <div className="w-full flex flex-col items-end gap-4 mt-24 px-4 pb-12">
        <h5>سلام حالتون چطوره خوش اومدین صفا اوردین 😁</h5>
        <h5>
          من یزدانم خوشحالم که این صفحه این مورد رو دارم توسعه میدم امیدوارم
          بتونم به همه دوستانی که دارند از نقشه نشان استفاده میکنند کمک کنم
        </h5>
        <span className="w-full flex flex-col items-end gap-4">
          <h5 className="text-right">
            غیر ممکنه که برنامه نویس فرانت اند باشی و به کار با نقشه ها برنخورده
            باشی یکی از چالش ها در این زمینه کار کردن با همین نقشه های مختلف هست
            که واقعا اگر داکیومنت مناسبی هم داشته باشند هم باز کلی طول میکشه
            بعضا بتونی قابلیت های مختلف رو در اونها پیاده سازی کنید و خب به
            نتیجه مطلوب برسید حالا فکرشو بکن داکیومنت مناسبی هم برای این کار
            وجود نداشته باشه که دیگه بدتر؛
          </h5>
          <h5 className="text-right">
            اول بیا باهم یه نگاهی به{" "}
            <LinkPreview
              url="https://platform.neshan.org/sdk/neshan-mapbox-gl-react-component/"
              imageSrc="/neshan.png"
              isStatic
              className="font-bold"
            >
              داکیومنت اصلی نقشه نشان
            </LinkPreview>{" "}
            بندازیم
          </h5>
          <h5 className="text-right">
            همینطور که همه میدونیم این داکیومنت ناقص هستش و کم و کاستی زیادی
            داره و خب من در یکی از پروژه های خودم نیاز بود از نقشه نشان استفاده
            کنم و کلی قابلیت رو هم بهش اضافه کنم و خب کلی طول کشید تا تونستم این
            کار رو انجام بدم و خب سختی های زیادی رو عملا پشت سر گذاشتم تا این
            اتفاق افتاد حالا میخوام تجربه خودم رو با شما در اشتراک بزارم در قالب
            کد که شما هم بتونین به راحتی ازش استفاده کنین و خب عملا این مشکل
            دیگه برای شما وجود نداشته باشه
          </h5>
          <h3 className="text-right font-bold">
            من یک توضیح هم در رابطه با مدل ایمپورت کردن نقشه بدم به این خاطر ما
            اس اس ار رو داخل نقشه فالس کردیم که نیاز هست یکسری دسترسی ها رو با
            کمک گرفتن المنت براساس آیدی یا کلاس اون المنت اعمال کنیم و این قضیه
            با ویژگی رندر کردن نکست به مشکل میخوره در نتیجه مجبور میشیم که این
            ویژگی رو فالس قرار بدیم البته که برای نسخه اولیه این مشکل وجود نداره
            اما خب تصمیم گرفتم ایمپورت کردن یکپارچه باشه تا همه چیز مشخص و خوانا
            باشه
          </h3>
          <h5 className="text-right">
            خب حالا که این موارد رو خوندی کافیه وارد بخش نقشه ها بشی تا بتونی
            موارد مختلف رو ببینی و ازشون استفاده کنی
          </h5>
          <h3 className="text-right font-bold">
            ضمنا اون دو بخش درباره من و تماس با من راه های ارتباطی با بنده هست و
            خب بعضی از موارد رو در مورد خودم براتون نوشتم که بتونید راحت با من
            در ارتباط باشید فقط یادتون نره که این داکیومنت رو برای دوستانتون هم
            ارسال کنید تا اونا هم ازش استفاده کنند
          </h3>
        </span>

        {/* <div className="w-full flex flex-col items-end gap-4 mt-4 font-bold">
          <h3>
            اولین حالت نقشه زمانی که نقشه بدون هیچ تغییری در صفحه قرار میگیره و
            هیچ کارایی خاصی هم نداره به شکل زیر میباشد
          </h3>
          <DynamicMapBox />
          <h4>
            همینطور که این بالا دیدین عزیزانم این نقشه چیزی هست که با کمک
            داکیومنت نقشه نشان میتونیم بسازیم و داشته باشیم که به درد هیچ برنامه
            نویسی نمیخوره عزیزان من
          </h4>
        </div> */}
      </div>
    </main>
  );
}
