import { Header } from "@/components/Header";

import dynamic from "next/dynamic";

// نوع بازگشتی مشخص شده است
const DynamicMapBox = dynamic<any>(
  () => import("@/components/Maps/FirstMap").then((mod) => mod.FirstMap as any),
  {
    ssr: false, // disable server-side rendering
  }
);

export default function Home() {
  return (
    <main className="w-full flex flex-col items-end">
      <Header />
      <div className="w-full flex flex-col items-end gap-4 mt-6 px-4">
        <h5>سلام حالتون چطوره خوش اومدین صفا اوردین 😁</h5>
        <h5>
          من یزدانم خوشحالم که این صفحه این مورد رو دارم توسعه میدم امیدوارم
          بتونم به همه دوستانی که دارند از نقشه نشان استفاده میکنند کمک کنم
        </h5>
        <h5 className="text-right">
          با توجه به این موضوع که داکیومنت اصلی نقشه نشان کاملا ناقص هست و
          نتونسته نیاز برنامه نویس ها رو برای این موضوع که چطور از نقشه استفاده
          کنیم و خب چطور قابلیت های مختلف رو به اون اضافه کنیم و ... موارد دیگه
          براورده کنه و من طی پروژه ای که داشتم اکثر این موارد رو خودم مجبور شدم
          یاد بگیرم و انجامش بدم تصمیم گرفتم این اطلاعات رو با شما دولوپر های
          عزیز به اشنراک بگذارم اون هم به رایگان تنها خاسته من از شما این هست که
          سورس رو شیر کنید تا به دست دیگران هم برسه و بتونند نیازهاشون رو برطرف
          کنند و خب اگر موردی هم نیاز داشتین که کاستوم بشه برای نقشه میتونین به
          ایمیل من که در هدر سایت قرار داره ایمیل بزنین تا من بررسی کنم و مدل مد
          نظر رو به لیست نقشه ها اضافه کنم؛
        </h5>
        <h3 className="text-right font-bold">
          من یک توضیح هم در رابطه با مدل ایمپورت کردن نقشه بدم به این خاطر ما اس
          اس اس رو داخل نقشه فالس کردیم که نیاز هست یکسری دسترسی ها رو با کمک
          گرفتن المنت براساس آیدی یا کلاس اون المنت اعمال کنیم و این قضیه با
          ویژگی رندر کردن نکست به مشکل میخوره در نتیجه مجبور میشیم که این ویژگی
          رو فالس قرار بدیم البته که برای نسخه اولیه این مشکل وجود نداره اما خب
          تصمیم گرفتم ایمپورت کردن یکپارچه باشه تا همه چیز مشخص و خوانا باشه
        </h3>
        <div className="w-full flex flex-col items-end gap-4 mt-4 font-bold">
          <h3>
            اولین حالت نقشه زمانی که نقشه بدون هیچ تغییری در صفحه قرار میگیره و
            هیچ کارایی خاصی هم نداره به شکل زیر میباشد
          </h3>
          <DynamicMapBox />
          <h4>
            همینطور که این بالا دیدین عزیزانم این نقشه چیزی هست که با کمک
            داکیومنت نقشه نشان میتونیم بسازیم و داشته باشیم که به درد هیچ برنامه
            نویسی نمیخوره عزیزان من
          </h4>
        </div>
      </div>
    </main>
  );
}
